In [1]:
# !pip install ipython-sql

In [2]:
%load_ext sql
%sql sqlite:///db.db3

In [3]:
%%sql
create table vendors (vend_id int, vend_name varchar(50));
insert into vendors values (101, 'Apple'), (102, 'Samsung'), (103, 'Xiaomi');

 * sqlite:///db.db3
Done.
3 rows affected.

[]

In [4]:
%%sql
create table products (prod_id int, prod_name varchar(50), vend_id int);
insert into products values (201, 'iPhone', 101), (202, 'Galaxy', 102), (203, 'Zalaxy', 102);

 * sqlite:///db.db3
Done.
3 rows affected.

[]

In [5]:
%sql select * from vendors, products

 * sqlite:///db.db3
Done.

[(101, 'Apple', 201, 'iPhone', 101),
 (101, 'Apple', 202, 'Galaxy', 102),
 (101, 'Apple', 203, 'Zalaxy', 102),
 (102, 'Samsung', 201, 'iPhone', 101),
 (102, 'Samsung', 202, 'Galaxy', 102),
 (102, 'Samsung', 203, 'Zalaxy', 102),
 (103, 'Xiaomi', 201, 'iPhone', 101),
 (103, 'Xiaomi', 202, 'Galaxy', 102),
 (103, 'Xiaomi', 203, 'Zalaxy', 102)]

* *simple equijoin syntax*

In [6]:
%sql select * from vendors inner join products

 * sqlite:///db.db3
Done.

[(101, 'Apple', 201, 'iPhone', 101),
 (101, 'Apple', 202, 'Galaxy', 102),
 (101, 'Apple', 203, 'Zalaxy', 102),
 (102, 'Samsung', 201, 'iPhone', 101),
 (102, 'Samsung', 202, 'Galaxy', 102),
 (102, 'Samsung', 203, 'Zalaxy', 102),
 (103, 'Xiaomi', 201, 'iPhone', 101),
 (103, 'Xiaomi', 202, 'Galaxy', 102),
 (103, 'Xiaomi', 203, 'Zalaxy', 102)]

* *ansi inner join syntax*

In [7]:
%sql select * from vendors left outer join products

 * sqlite:///db.db3
Done.

[(101, 'Apple', 201, 'iPhone', 101),
 (101, 'Apple', 202, 'Galaxy', 102),
 (101, 'Apple', 203, 'Zalaxy', 102),
 (102, 'Samsung', 201, 'iPhone', 101),
 (102, 'Samsung', 202, 'Galaxy', 102),
 (102, 'Samsung', 203, 'Zalaxy', 102),
 (103, 'Xiaomi', 201, 'iPhone', 101),
 (103, 'Xiaomi', 202, 'Galaxy', 102),
 (103, 'Xiaomi', 203, 'Zalaxy', 102)]

* *ansi outer join syntax*

* *3 запроса выше выдают один и тот же результат*
* *несмотря на то, что для одного из вендоров (Xiaomi) в базе нет ни одного продукта*
* *любой join по природе своей выполняет перекрестное произведение (cross join)*
* *каждая строка одной таблицы соединяется с каждой строкой второй таблицы*
* *в результате получаем все возможные сочетания строк двух таблиц*
* *разница между inner join и outer join начинает проявляться только при добавлении условий (where / on)*
* *on выполняет ту же функцию, что и where - фильтрацию результатов работы cross join*

In [8]:
%sql select * from products, vendors where products.vend_id = vendors.vend_id

 * sqlite:///db.db3
Done.

[(201, 'iPhone', 101, 101, 'Apple'),
 (202, 'Galaxy', 102, 102, 'Samsung'),
 (203, 'Zalaxy', 102, 102, 'Samsung')]

In [9]:
%sql select * from products inner join vendors on products.vend_id = vendors.vend_id

 * sqlite:///db.db3
Done.

[(201, 'iPhone', 101, 101, 'Apple'),
 (202, 'Galaxy', 102, 102, 'Samsung'),
 (203, 'Zalaxy', 102, 102, 'Samsung')]

* *on и where: разный синтаксис, одна и та же фукнция - фильтрация для cross join*

In [10]:
%sql select * from products inner join vendors

 * sqlite:///db.db3
Done.

[(201, 'iPhone', 101, 101, 'Apple'),
 (201, 'iPhone', 101, 102, 'Samsung'),
 (201, 'iPhone', 101, 103, 'Xiaomi'),
 (202, 'Galaxy', 102, 101, 'Apple'),
 (202, 'Galaxy', 102, 102, 'Samsung'),
 (202, 'Galaxy', 102, 103, 'Xiaomi'),
 (203, 'Zalaxy', 102, 101, 'Apple'),
 (203, 'Zalaxy', 102, 102, 'Samsung'),
 (203, 'Zalaxy', 102, 103, 'Xiaomi')]

* *join является сокращенной формой записи inner join*

In [11]:
%sql select * from products left outer join vendors

 * sqlite:///db.db3
Done.

[(201, 'iPhone', 101, 101, 'Apple'),
 (201, 'iPhone', 101, 102, 'Samsung'),
 (201, 'iPhone', 101, 103, 'Xiaomi'),
 (202, 'Galaxy', 102, 101, 'Apple'),
 (202, 'Galaxy', 102, 102, 'Samsung'),
 (202, 'Galaxy', 102, 103, 'Xiaomi'),
 (203, 'Zalaxy', 102, 101, 'Apple'),
 (203, 'Zalaxy', 102, 102, 'Samsung'),
 (203, 'Zalaxy', 102, 103, 'Xiaomi')]

* *left / right join является сокращенной формой записи left / right outer join*

In [12]:
%sql select * from products inner join vendors on products.vend_id = vendors.vend_id

 * sqlite:///db.db3
Done.

[(201, 'iPhone', 101, 101, 'Apple'),
 (202, 'Galaxy', 102, 102, 'Samsung'),
 (203, 'Zalaxy', 102, 102, 'Samsung')]

In [13]:
%sql select * from vendors inner join products on products.vend_id = vendors.vend_id

 * sqlite:///db.db3
Done.

[(101, 'Apple', 201, 'iPhone', 101),
 (102, 'Samsung', 202, 'Galaxy', 102),
 (102, 'Samsung', 203, 'Zalaxy', 102)]

In [14]:
%sql select * from products left join vendors on products.vend_id = vendors.vend_id

 * sqlite:///db.db3
Done.

[(201, 'iPhone', 101, 101, 'Apple'),
 (202, 'Galaxy', 102, 102, 'Samsung'),
 (203, 'Zalaxy', 102, 102, 'Samsung')]

In [15]:
%sql select * from vendors left join products on products.vend_id = vendors.vend_id

 * sqlite:///db.db3
Done.

[(101, 'Apple', 201, 'iPhone', 101),
 (102, 'Samsung', 202, 'Galaxy', 102),
 (102, 'Samsung', 203, 'Zalaxy', 102),
 (103, 'Xiaomi', None, None, None)]

* *последние 4 запроса хорошо отражают разницу в работе inner join и outer join*
* *для inner join не важно, какая таблица слева, и какая справа (указаны в запросе)*
* *в любом случае выполняется cross join с фильтрацией по указанному условию*
* *все пары, соответствующие условию фильтра, выдаются в качестве результата*

* *для outer join (в данном случае left) уже важно, какая таблица слева, и какая справа*
* *если в результате работы left join после фильтрации для какого-либо элемента из левой таблички не осталось ни одной пары в результирующей табличке, то этот элемент из левой таблички все равно будет добавлен (один раз), при этом поля правой таблички для этой строчки будут заполнены null / none.*
* *в данном случае для каждого продукта нашелся вендор, но для одного из вендоров (Xiaomi) не нашлось ни одного продукта (последняя строчка последней таблички)*

In [16]:
%sql select * from products as p1 inner join products as p2

 * sqlite:///db.db3
Done.

[(201, 'iPhone', 101, 201, 'iPhone', 101),
 (201, 'iPhone', 101, 202, 'Galaxy', 102),
 (201, 'iPhone', 101, 203, 'Zalaxy', 102),
 (202, 'Galaxy', 102, 201, 'iPhone', 101),
 (202, 'Galaxy', 102, 202, 'Galaxy', 102),
 (202, 'Galaxy', 102, 203, 'Zalaxy', 102),
 (203, 'Zalaxy', 102, 201, 'iPhone', 101),
 (203, 'Zalaxy', 102, 202, 'Galaxy', 102),
 (203, 'Zalaxy', 102, 203, 'Zalaxy', 102)]

In [17]:
%sql select * from products as p1 inner join products as p2 where p1.prod_id <> p2.prod_id

 * sqlite:///db.db3
Done.

[(201, 'iPhone', 101, 202, 'Galaxy', 102),
 (201, 'iPhone', 101, 203, 'Zalaxy', 102),
 (202, 'Galaxy', 102, 201, 'iPhone', 101),
 (202, 'Galaxy', 102, 203, 'Zalaxy', 102),
 (203, 'Zalaxy', 102, 201, 'iPhone', 101),
 (203, 'Zalaxy', 102, 202, 'Galaxy', 102)]

* *self join: одна и та же таблица и слева и справа*